# -*- coding: utf-8 -*-
# -*- mode: org -*-
# -*- org-export-babel-evaluate: nil -*-
# -- org-startup-with-inline-images: nil --
# -*- org-image-actual-width: nil; -*-
#+TITLE: Atividade Didática
#+AUTHOR: Lucas Leandro Nesi
#+EMAIL: lucas.nesi@inf.ufrgs.br
#+DATE: September 1, 2019
#+STARTUP: overview indent noinlineimages
#+LANGUAGE: pt-br
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:nil title:nil date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

*** Setup
#+BEGIN_SRC emacs-lisp
;;http://pragmaticemacs.com/emacs/scrolling-and-moving-by-line/
;;keep cursor at same position when scrolling
(setq scroll-preserve-screen-position 1)
;;scroll window up/down by one line
(global-set-key (kbd "M-n") (kbd "C-u 1 C-v"))
(global-set-key (kbd "M-p") (kbd "C-u 1 M-v"))
#+END_SRC

#+RESULTS:
: [21 49 134217846]

*** Setup
#+BEGIN_SRC emacs-lisp
;;http://pragmaticemacs.com/emacs/scrolling-and-moving-by-line/
;;keep cursor at same position when scrolling
(setq scroll-preserve-screen-position 1)
;;scroll window up/down by one line
(global-set-key (kbd "M-n") (kbd "C-u 1 C-v"))
(global-set-key (kbd "M-p") (kbd "C-u 1 M-v"))
#+END_SRC

#+RESULTS:
: [21 49 134217846]

** Open pngs
#+begin_src emacs-lisp
(require 'openwith)
(openwith-mode t)
(setq openwith-associations '(("\\.png\\'" "eog" (file))))
#+end_src

#+RESULTS:
| \.png\' | eog | (file) |

